//
//  Data.swift
//  Collection
//
//  Created by Адам Табиев on 12.07.2024.
//

import Foundation

let Data = [
    HumanModel(
        name: "Имануил Кант",
        briefBio: "Немецкий философ эпохи Просвещения",
        biography: "немецкий философ-критик, представитель немецкого идеализма, автор фундаментальных работ по теории познания, этике, эстетике и метафизике.",
        comments: [
            "Две вещи наполняют душу уважением и восхищением: звёздное небо надо мной и моральный закон во мне.",
            "Разум имеет две задачи: начать себя и начать всё остальное.",
            "Смелость — это способность действовать вопреки своим страхам."
        ]
    ),
    HumanModel(
        name: "Платон",
        briefBio: "древнегреческий философ 5 век до н.э., ученик Сократа, учитель Аристотеля.",
        biography: "афинский философ классического периода Древней Греции, основатель платонической школы мысли и Академии, первого высшего учебного заведения в западном мире. Он считается одним из самых важных и влиятельных людей в истории человечества и ключевой фигурой в истории древнегреческой и западной философии вместе со своим учителем Сократом и его самым известным учеником Аристотелем. Платона также часто называют одним из основателей западной религии и духовности. Так называемый неоплатонизм философов, таких как Плотин и Порфирий, сильно повлиял на христианство через таких отцов церкви, как Августин. Альфред Норт Уайтхед однажды заметил: «Наиболее правдоподобная общая характеристика европейской философской традиции состоит в том, что она представляет собой серию примечаний к Платону».",
        comments: [
            "Воспитание есть усвоение хороших привычек.",
            "Стараясь о счастье других, мы находим свое собственное.",
            "Наилучшее воспитание молодых людей, да и самих себя, заключается не во внушениях, а в явном для всех осуществлении в собственной жизни того, что внушается другому."
        ]
    ),
    HumanModel(
        name: "Сократ",
        briefBio: "Древнегреческий философ 5 век до н.э",
        biography: "Его учение разделило древнегреческую философию на «досократический» и «сократовский» периоды. В отличие от предшественников, которых интересовали вопросы сотворения космоса и всего сущего, Сократ стал изучать внутренний мир человека. С Сократом и его учением связаны разнообразные парадоксы. Один из них состоит в том, что нашим современникам ничего достоверно не известно о деталях учения Сократа. В то же время не вызывает сомнения «разворот» направления развития философии, который связан с именем Сократа. Согласно античной традиции, переломным моментом в жизни Сократа стало пророчество дельфийской пифии. Жрица Аполлона «передала слова бога», что самым умным среди людей является Сократ. После этого Сократ начал воспринимать свои беседы о мудрости как служение божеству. Супруга Сократа Ксантиппа, на которую легли заботы о детях и домашнем быте, была недовольна таким положением вещей. Её имя стало нарицательным для сварливых жён. Отношение к Сократу в афинском обществе было амбивалентным. Для одних он был олицетворением великого мудреца, для других — нечистым на руку шарлатаном, который совращает молодёжь и не почитает богов. В 423 году до н. э. Аристофан поставил на сцене комедию «Облака», в которой едко и зло высмеял Сократа. С именами учеников Сократа связано возникновение нескольких философских школ, которые имели прямо противоположные взгляды. К примеру, Аристипп стал основателем школы гедонистов киренаиков, а Антисфен — киников, которые отвергали материальные блага. Большинство учеников, среди которых был и Платон, боготворило учителя. Сам же Сократ не считал себя мудрым. В понимании философа вся его мудрость заключалась лишь в том, что «он знает, что ничего не знает». Цель жизни Сократа состояла в поиске истины, которую он стремился найти во время дискуссий и бесед с учениками. По прошествии тысячелетий образ Сократа не утратил своей привлекательности. В различные эпохи он оставался таким же противоречивым, как и в античности. С XIX века в среде учёных-антиковедов идут споры относительно того, каким же был настоящий, «истинный» Сократ. Античные источники настолько противоречивы, что не дают однозначного ответа на данный вопрос. Проблема «поиска настоящего Сократа» получила название «сократического вопроса[en]» и на начало XXI века остаётся нерешённой.",
        comments: [
            "Кто хочет — ищет способ, кто не хочет — ищет причину",
            "Жизнь — искусство, для овладения которым необходимо знание, знание цели, к которой следует стремиться.",
            "Не делайте другим того, что не нравится вам, когда это совершается по отношению к вам."
        ]
    ),
    HumanModel(
        name: "Карл Саган",
        briefBio: "Американский астрофизик и популяризатор науки",
        biography: "известный астрофизик, автор книги 'Космос', ведущий научно-популярных телепрограмм, активный популяризатор науки.",
        comments: [
            "Мы звёздная пыль, исследующая звёзды.",
            "Наш дом — это вселенная.",
            "Есть места, где уместно спорить о деталях, но не оценивать значимость. Это как спорить, сколько километров до середины океана."
        ]
    ),
    HumanModel(
        name: "Цицерон",
        briefBio: "Древнеримский политик и философ",
        biography: "древнеримский политик, оратор и философ, автор множества философских и риторических произведений.",
        comments: [
            "Дружба — это своего рода душа, обитающая в двух телах.",
            "Лучший способ предсказать будущее — это его изучить.",
            "Искусство счастья состоит в том, чтобы знать, как находить удовольствие из любого положения."
        ]
    )
]
